TestPlans/Car/Debenhams/xml/DCI3_21112014_2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="www.openecommerce.co.uk">
  <soap:Body>
    <ns1:getQuote>
      <requestXML>&lt;Request&gt;
  &lt;Product&gt;Motor&lt;/Product&gt;
  &lt;AggregatorID&gt;CTM1708&lt;/AggregatorID&gt;
  &lt;Quote Id="1"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="2"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="3"&gt;
    &lt;BrokerReference&gt;ELD19010&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="4"&gt;
    &lt;BrokerReference&gt;DSI0012606&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="5"&gt;
    &lt;BrokerReference&gt;KWR0104&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="6"&gt;
    &lt;BrokerReference&gt;PRC2407&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="7"&gt;
    &lt;BrokerReference&gt;INC807&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="8"&gt;
    &lt;BrokerReference&gt;EDB0311&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
&lt;/Request&gt;</requestXML>
      <riskXML>&lt;Risk&gt;
  &lt;Policy&gt;
    &lt;CoverDate&gt;24/11/2014&lt;/CoverDate&gt;
    &lt;InsCancelled abiCode="N" /&gt;
    &lt;InsRefused abiCode="N" /&gt;
    &lt;ImposedTerms abiCode="N" /&gt;
    &lt;PrevPayment&gt;A&lt;/PrevPayment&gt;
    &lt;VolExcess&gt;900&lt;/VolExcess&gt;
    &lt;TotalVehiclesInHousehold&gt;2&lt;/TotalVehiclesInHousehold&gt;
  &lt;/Policy&gt;
  &lt;Person&gt;
    &lt;ContactEmail&gt;transformerPC02@emailreaction.org&lt;/ContactEmail&gt;
    &lt;ContactTelephone&gt;01733345678&lt;/ContactTelephone&gt;
    &lt;ContactAlternatePhone&gt;01733345678&lt;/ContactAlternatePhone&gt;
    &lt;Address1&gt;174 Partington Lane&lt;/Address1&gt;
    &lt;Address2&gt;Swinton&lt;/Address2&gt;
    &lt;Address3&gt;Manchester&lt;/Address3&gt;
    &lt;Address4 /&gt;
    &lt;PostCode&gt;M27 0WN&lt;/PostCode&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus&gt;N&lt;/EmpBus&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="Y" /&gt;
    &lt;OtherOwnVehType&gt;PC&lt;/OtherOwnVehType&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;OtherOwnVehNCB abiCode="0" /&gt;
    &lt;DateMovedToUK&gt;1980-02-02&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;02/02/1980&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="M" /&gt;
    &lt;FirstName&gt;Barbara&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;HomeOwner abiCode="Y" /&gt;
    &lt;LicHeld&gt;20&lt;/LicHeld&gt;
    &lt;LicType abiCode="F" /&gt;
    &lt;LicUnit&gt;M&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="P" /&gt;
    &lt;OtherCompanyVehYears&gt;0&lt;/OtherCompanyVehYears&gt;
    &lt;OtherVehNCB&gt;0&lt;/OtherVehNCB&gt;
    &lt;Surname&gt;Two&lt;/Surname&gt;
    &lt;Title&gt;Mrs&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;100&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;N&lt;/AtFault&gt;
      &lt;IncidentType&gt;tPR&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/05/2012&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="A" /&gt;
      &lt;NCBAff&gt;N&lt;/NCBAff&gt;
      &lt;Date&gt;01/05/2012&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="250" /&gt;
      &lt;EmpStat abiCode="S" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="031" /&gt;
    &lt;/Occupation&gt;
    &lt;PrivateMileage&gt;4999&lt;/PrivateMileage&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehInd abiCode="Y" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;DateMovedToUK&gt;1977-07-05&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;05/07/1977&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Betty&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;LicHeld&gt;9&lt;/LicHeld&gt;
    &lt;LicType abiCode="F" /&gt;
    &lt;LicUnit&gt;M&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="P" /&gt;
    &lt;OtherVehNCB&gt;0&lt;/OtherVehNCB&gt;
    &lt;Surname&gt;Two&lt;/Surname&gt;
    &lt;Title&gt;Mrs&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/09/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="T" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/09/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="246" /&gt;
      &lt;EmpStat abiCode="S" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="B15" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="J" /&gt;
  &lt;/Person&gt;
  &lt;Vehicle&gt;
    &lt;ABICode&gt;04060903&lt;/ABICode&gt;
    &lt;AlarmSecurityFitted&gt;Unknown&lt;/AlarmSecurityFitted&gt;
    &lt;CoverType abiCode="01" /&gt;
    &lt;EstimatedValue&gt;6000&lt;/EstimatedValue&gt;
    &lt;Keeper abiCode="E" /&gt;
    &lt;Lhd&gt;Y&lt;/Lhd&gt;
    &lt;Modified abiCode="N" /&gt;
    &lt;NCBYears&gt;0&lt;/NCBYears&gt;
    &lt;NightLocation abiCode="1" /&gt;
    &lt;Owner abiCode="E" /&gt;
    &lt;OvernightPostCode&gt;M27 0WN&lt;/OvernightPostCode&gt;
    &lt;PurchaseDate&gt;01/07/2013&lt;/PurchaseDate&gt;
    &lt;Registration&gt;R974LGH&lt;/Registration&gt;
    &lt;YearManufacture&gt;1997&lt;/YearManufacture&gt;
    &lt;Seats&gt;2&lt;/Seats&gt;
  &lt;/Vehicle&gt;
&lt;/Risk&gt;</riskXML>
    </ns1:getQuote>
  </soap:Body>
</soap:Envelope>